Revit 2027 API
Form.IsBeginningFace Method
Given a face, tell if it is a beginning cap face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBeginningFace(
	Reference faceReference
)
Public Function IsBeginningFace (
	faceReference As Reference
) As Boolean
public:
bool IsBeginningFace(
	Reference^ faceReference
)
member IsBeginningFace :
        faceReference : Reference -> bool
Parameters
faceReference Reference
The reference of the face to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace